---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericIsMetal
source: html/36fa3ab5-1165-f7fc-a67c-6b5939193de4.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericIsMetal Property

The property labeled "Highlights" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericIsMetal { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".